def test():
    # Test
    assert( total_area == 69.6
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"

    assert("areas[1]" in __solution__
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"
    assert("areas[3]" in __solution__
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"  
    assert("areas[5]" in __solution__
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"
    assert("areas[7]" in __solution__
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"
    assert("areas[9]" in __solution__
           ), "اجابة خاطئة: لم تقم بحساب المساحة الكلية للمنزل بشكل صحيح"
    __msg__.good("اجابة صحيحة. احسنت")
